#ifndef	__WATCHDOW_H__
#define	__WATCHDOW_H__


#include "Common.h"
#include "BSP.h"


//独立看门狗周期
typedef enum 
{
	MS409,
	MS819,
	MS1638,
	MS3276,
	MS6553,
	MS13107,
	MS26214,
}WDTInterval;


/*******************************************************************
作用：看门狗初始化复位时间，并开始运行
参数：
	MS409,
	MS819,
	MS1638,
	MS3276,
	MS6553,
	MS13107,
	MS26214,
返回：无
*******************************************************************/
extern void BSPWatchDogInit(WDTInterval time);




/*******************************************************************
作用：喂狗函数
参数：无
返回：无
*******************************************************************/
extern void BSPWatchDogReset(void);


#endif



